; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v8 ?v7)
             (pred_3 ?v13 ?v10)
             (pred_11 ?v8 ?v10)
             (pred_2 ?v12 ?v8 )
	     (pred_1 ?v8)
             (pred_4 ?v9)
             (pred_8 ?v13)
             (pred_12 ?v10)
             (pred_10 ?v8)
             (pred_9 ?v13)
             (pred_6 ?v8)
             (pred_5 ))



(:action op_3
:parameters (?v5 ?v6 ?v4 ?v11)
:precondition (and (pred_4 ?v5) (pred_4 ?v6) (pred_8 ?v4) (pred_12 ?v11)
          (pred_7 ?v5 ?v6) (pred_3 ?v4 ?v11)
                   (pred_11 ?v6 ?v11) (pred_1 ?v5) 
                   (pred_10 ?v6) (pred_9 ?v4))
:effect (and  (pred_6 ?v6) (not (pred_10 ?v6))))


(:action op_4
:parameters (?v5 ?v1)
:precondition (and (pred_4 ?v5) (pred_4 ?v1)
               (pred_1 ?v5) (pred_7 ?v5 ?v1) (pred_6 ?v1))
:effect (and (pred_1 ?v1) (not (pred_1 ?v5))))

(:action op_2
:parameters (?v5 ?v4)
:precondition (and (pred_4 ?v5) (pred_8 ?v4) 
                  (pred_1 ?v5) (pred_2 ?v4 ?v5) (pred_5 ))
:effect (and (pred_9 ?v4)
   (not (pred_2 ?v4 ?v5)) (not (pred_5 ))))


(:action op_5
:parameters (?v5 ?v3 ?v2)
:precondition (and (pred_4 ?v5) (pred_8 ?v3) (pred_8 ?v2)
                  (pred_1 ?v5) (pred_9 ?v2) (pred_2 ?v3 ?v5))
:effect (and (pred_9 ?v3) (pred_2 ?v2 ?v5)
        (not (pred_9 ?v2)) (not (pred_2 ?v3 ?v5))))

(:action op_1
:parameters (?v5 ?v4)
:precondition (and (pred_4 ?v5) (pred_8 ?v4) 
                  (pred_1 ?v5) (pred_9 ?v4))
:effect (and (pred_5 ) (pred_2 ?v4 ?v5) (not (pred_9 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_28 obj_24 obj_15 obj_12 obj_02 obj_06 obj_11 obj_21 obj_07 obj_03 obj_20 obj_30 obj_17 obj_27 obj_01 obj_23 obj_19 obj_08 obj_09 obj_04 obj_32 obj_14 obj_22 obj_18 obj_29
    obj_31 obj_16 obj_25
    obj_13 obj_26 obj_10 obj_05
    )

    (:init
       (pred_5)

       (pred_4 obj_28)
       (pred_4 obj_24)
       (pred_4 obj_15)
       (pred_4 obj_12)
       (pred_4 obj_02)
       (pred_4 obj_06)
       (pred_4 obj_11)
       (pred_4 obj_21)
       (pred_4 obj_07)
       (pred_4 obj_03)
       (pred_4 obj_20)
       (pred_4 obj_30)
       (pred_4 obj_17)
       (pred_4 obj_27)
       (pred_4 obj_01)
       (pred_4 obj_23)
       (pred_4 obj_19)
       (pred_4 obj_08)
       (pred_4 obj_09)
       (pred_4 obj_04)
       (pred_4 obj_32)
       (pred_4 obj_14)
       (pred_4 obj_22)
       (pred_4 obj_18)
       (pred_4 obj_29)
       (pred_12 obj_31)
       (pred_12 obj_16)
       (pred_12 obj_25)
       (pred_8 obj_13)
       (pred_8 obj_26)
       (pred_8 obj_10)
       (pred_8 obj_05)

       (pred_7 obj_28 obj_06)
       (pred_7 obj_28 obj_24)
       (pred_7 obj_24 obj_11)
       (pred_7 obj_24 obj_15)
       (pred_7 obj_24 obj_28)
       (pred_7 obj_15 obj_21)
       (pred_7 obj_15 obj_12)
       (pred_7 obj_15 obj_24)
       (pred_7 obj_12 obj_07)
       (pred_7 obj_12 obj_02)
       (pred_7 obj_12 obj_15)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_02 obj_12)
       (pred_7 obj_06 obj_20)
       (pred_7 obj_06 obj_11)
       (pred_7 obj_06 obj_28)
       (pred_7 obj_11 obj_30)
       (pred_7 obj_11 obj_21)
       (pred_7 obj_11 obj_24)
       (pred_7 obj_11 obj_06)
       (pred_7 obj_21 obj_17)
       (pred_7 obj_21 obj_07)
       (pred_7 obj_21 obj_15)
       (pred_7 obj_21 obj_11)
       (pred_7 obj_07 obj_27)
       (pred_7 obj_07 obj_03)
       (pred_7 obj_07 obj_12)
       (pred_7 obj_07 obj_21)
       (pred_7 obj_03 obj_01)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_03 obj_07)
       (pred_7 obj_20 obj_23)
       (pred_7 obj_20 obj_30)
       (pred_7 obj_20 obj_06)
       (pred_7 obj_30 obj_19)
       (pred_7 obj_30 obj_17)
       (pred_7 obj_30 obj_11)
       (pred_7 obj_30 obj_20)
       (pred_7 obj_17 obj_08)
       (pred_7 obj_17 obj_27)
       (pred_7 obj_17 obj_21)
       (pred_7 obj_17 obj_30)
       (pred_7 obj_27 obj_09)
       (pred_7 obj_27 obj_01)
       (pred_7 obj_27 obj_07)
       (pred_7 obj_27 obj_17)
       (pred_7 obj_01 obj_04)
       (pred_7 obj_01 obj_03)
       (pred_7 obj_01 obj_27)
       (pred_7 obj_23 obj_32)
       (pred_7 obj_23 obj_19)
       (pred_7 obj_23 obj_20)
       (pred_7 obj_19 obj_14)
       (pred_7 obj_19 obj_08)
       (pred_7 obj_19 obj_30)
       (pred_7 obj_19 obj_23)
       (pred_7 obj_08 obj_22)
       (pred_7 obj_08 obj_09)
       (pred_7 obj_08 obj_17)
       (pred_7 obj_08 obj_19)
       (pred_7 obj_09 obj_18)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_09 obj_27)
       (pred_7 obj_09 obj_08)
       (pred_7 obj_04 obj_29)
       (pred_7 obj_04 obj_01)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_32 obj_14)
       (pred_7 obj_32 obj_23)
       (pred_7 obj_14 obj_22)
       (pred_7 obj_14 obj_19)
       (pred_7 obj_14 obj_32)
       (pred_7 obj_22 obj_18)
       (pred_7 obj_22 obj_08)
       (pred_7 obj_22 obj_14)
       (pred_7 obj_18 obj_29)
       (pred_7 obj_18 obj_09)
       (pred_7 obj_18 obj_22)
       (pred_7 obj_29 obj_04)
       (pred_7 obj_29 obj_18)
       (pred_10 obj_29)
       (pred_10 obj_12)
       (pred_10 obj_28)
       (pred_10 obj_01)
       (pred_11  obj_29 obj_31)
       (pred_11  obj_12 obj_16)
       (pred_11  obj_28 obj_25)
       (pred_11  obj_01 obj_31)
       (pred_6 obj_24)
       (pred_6 obj_15)
       (pred_6 obj_02)
       (pred_6 obj_06)
       (pred_6 obj_11)
       (pred_6 obj_21)
       (pred_6 obj_07)
       (pred_6 obj_03)
       (pred_6 obj_20)
       (pred_6 obj_30)
       (pred_6 obj_17)
       (pred_6 obj_27)
       (pred_6 obj_23)
       (pred_6 obj_19)
       (pred_6 obj_08)
       (pred_6 obj_09)
       (pred_6 obj_04)
       (pred_6 obj_32)
       (pred_6 obj_14)
       (pred_6 obj_22)
       (pred_6 obj_18)

       (pred_3  obj_13 obj_31)
       (pred_3  obj_26 obj_16)
       (pred_3  obj_10 obj_25)
       (pred_3  obj_05 obj_16)
       (pred_2 obj_13 obj_06)
       (pred_2 obj_26 obj_02)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_05 obj_04)
       (pred_1 obj_32)
    )

    (:goal (and
       (pred_2 obj_10 obj_21)
       (pred_2 obj_05 obj_24)
    ))
(:constraints
  (always (not (pred_1 obj_08)))
)
)

; plan
1. (op_4 obj_32 obj_23)
   deleted: (pred_1 obj_32)
   added: (pred_1 obj_23)
   goals met: 0 of 2
2. (op_4 obj_23 obj_19)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_19)
   goals met: 0 of 2
3. (op_4 obj_19 obj_30)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_30)
   goals met: 0 of 2
4. (op_4 obj_30 obj_17)
   deleted: (pred_1 obj_30)
   added: (pred_1 obj_17)
   goals met: 0 of 2
5. (op_4 obj_17 obj_27)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_27)
   goals met: 0 of 2
6. (op_4 obj_27 obj_09)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_09)
   goals met: 0 of 2
7. (op_4 obj_09 obj_04)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_04)
   goals met: 0 of 2
8. (op_2 obj_04 obj_05)
   deleted: (pred_2 obj_05 obj_04) (pred_5)
   added: (pred_9 obj_05)
   goals met: 0 of 2
9. (op_4 obj_04 obj_09)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_09)
   goals met: 0 of 2
10. (op_4 obj_09 obj_27)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_27)
   goals met: 0 of 2
11. (op_4 obj_27 obj_07)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_07)
   goals met: 0 of 2
12. (op_4 obj_07 obj_21)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_21)
   goals met: 0 of 2
13. (op_4 obj_21 obj_15)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_15)
   goals met: 0 of 2
14. (op_4 obj_15 obj_24)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_24)
   goals met: 0 of 2
15. (op_1 obj_24 obj_05)
   deleted: (pred_9 obj_05)
   added: (pred_5) (pred_2 obj_05 obj_24)
   goals met: 1 of 2
16. (op_4 obj_24 obj_15)
   deleted: (pred_1 obj_24)
   added: (pred_1 obj_15)
   goals met: 1 of 2
17. (op_2 obj_15 obj_10)
   deleted: (pred_2 obj_10 obj_15) (pred_5)
   added: (pred_9 obj_10)
   goals met: 1 of 2
18. (op_4 obj_15 obj_21)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_21)
   goals met: 1 of 2
19. (op_1 obj_21 obj_10)
   deleted: (pred_9 obj_10)
   added: (pred_5) (pred_2 obj_10 obj_21)
   goals met: 2 of 2
